In [12]:
import pandas as pd
import numpy as np
employee_details={'firstname':['aryan','aswin','moksith','harsith','varun','xyz','pqr'],
                  'lastname':['k','v','r','z','l','l','b'],
                 'type':['full_time','intern','full_time','part_time','full_time','intern','full_time'],
                 'department':['administartion','technical','administartion','technical','administartion','administartion','technical'],
                 'yoe':[2,3,4,5,6,1,7],
                 'salary':[20000,5000,10000,10000,20000,4000,30000]}
df=pd.DataFrame(employee_details)
df

  firstname lastname       type      department  yoe  salary
0     aryan        k  full_time  administartion    2   20000
1     aswin        v     intern       technical    3    5000
2   moksith        r  full_time  administartion    4   10000
3   harsith        z  part_time       technical    5   10000
4     varun        l  full_time  administartion    6   20000
5       xyz        l     intern  administartion    1    4000
6       pqr        b  full_time       technical    7   30000

In [16]:
table=pd.pivot_table(df,index=['type','department'],values='salary')
table

                                salary
type      department
full_time administartion  16666.666667
          technical       30000.000000
intern    administartion   4000.000000
          technical        5000.000000
part_time technical       10000.000000

In [18]:
pivot=pd.pivot_table(df,index=['type'],values='salary',aggfunc=['mean','sum'])
pivot

            mean    sum
          salary salary
type
full_time  20000  80000
intern      4500   9000
part_time  10000  10000

In [21]:
pt=pd.pivot_table(df,index=['type'],values='salary',aggfunc=len)
pt

           salary
type
full_time       4
intern          2
part_time       1

In [24]:
def add(x,y):
  return x+y
list=[2,4,7,3]
print(reduce(add,list))

NameError: name 'reduce' is not defined

In [30]:
from functools import reduce
def add(x,y):
  return x+y
list=[2,4,7,3]
print(reduce(add,list))

16